{
    "TITLE": "Vaihe 2: Tutki Kohdeverkkosivustoa",
    "INTRO": "Tutki verkkosivustoa ymmärtääksesi sen tarkoituksen, toiminnallisuudet ja käyttötavan. Tämä vaihe auttaa sinua määräämään mitä verkkosisivuja käyttää arviointiin seuraavissa vaiheissa. Tunnista sivuston toteutuksessa käytetyt verkkoteknologiat, ja jos tahdot, ota muistiinpanoja verkkosivun muista ominaisuuksista. Tavallisesti on parasta saada tietoja verkkosivun omistajalta ja kehittäjiltä tähän vaiheeseen. Enemmän ohjeistusta tähän vaiheeseen on saatavilla <a href={{link_em_2}}>WCAG-EM Vaihe 2: Tutki Kohdeverkkosivustoa</a>.",
    "HD_RELIEDUP_TECH": "Käytetyt Verkkoteknologiat",
    "INF_RELIEDUP_TECH": "Tunnista verkkoteknologiat <a href={{link_relied_upon}}>joita käytetään WCAG 2.0 mukaisesti</a> verkkosivuston luomiseen. Lisää tietoa saadaksesi, katso <a href={{link_em_2d}}>WCAG-EM Vaihe 2.d: Tunnista Käytetyt Verkkoteknologiat</a>.<br> Huomaa: Lisääksesi muita teknologioita, valitse 'Muut' ja käytä 'Verkkoteknologia' ja 'Määritelmän osoite (URL) kenttää. 'Määritelmän osoite (URL)' pitäisi osoittaa verkkoteknologian määritelmään.",
    "LABEL_TECH": "Verkkoteknologia",
    "LABEL_TECH_SPEC": "Määritelmän osoite (URL)",
    "PLH_TECH": "Esim. HTML5, CSS, DOM",
    "PLH_TECH_SPEC": "Osoite (URL) tai verkkoteknologiamääritelmän kuvaus",
    "BTN_REMOVE_TECH": "Poista teknologia",
    "BTN_ADD_TECH": "Lisää verkkoteknologia",
    "HD_NOTE_TAKING": "Muut tutkailuhuomiot",
    "INF_NOTE_TAKING": "Tämä osio antaa sinun tallettaa verkkosivun tutkailun aikaista tietoa. Nämä muistiinpanot ovat käytettävissä seuraavassa vaiheessa, auttaakseen sinua valitsemaan näytteen verkkosivuista arviointia varten. <strong>Näitä muistiinpanoja ei sisällytetä lopulliseen raporttiin.</strong> Ne talletetaan kun talletat tiedoston, ja ovat saatavilla kun myöhemmin lataat tiedoston uudestaan",
    "LABEL_ESSENT_FUNC": "Sivuston olennaiset toiminnot",
    "INF_ESSENT_FUNC": "Voit käyttää tätä kenttää ottaaksesi muistiinpanoja verkkosivun oleellisista toiminnoista. Esimerkkejä oleellisesta toiminnoista ovat:<br> 'tuotteen valinta ja ostaminen verkkosivuston kauppa-alueella'<br> 'verkkosivun tarjoaman lomakkeen täyttäminen ja lähetys '<br> 'käyttäjätunnuksen luonti verkkosivulle'<br>. Lisätiedoiksi katso <a href={{link_em_2b}}>WCAG-EM Vaihe 2.b: Tunnista verkkosivun olennaiset toiminnot</a>.",
    "LABEL_VARIETY_PAGE_TYPES": "Verkkosivutyyppien vaihtelu",
    "INF_VARIETY_PAGE_TYPES": "Voit käyttää tätä kenttää ottaaksesi muistiinpanoja tyypeistä (vastakohana instansseista) verkkosivuista, joita löydät sivustolta. Tämä sisällyttää muistiinpanoja sivuston erilaisista tyyleistä, sivurakenteista, rakenteista ja toiminnallisuuksista. Lisätietoja saadaksesi, katso <a href={{link_em_2c}}>WCAG-EM Vaihe 2.c: Tunnista verkkosivutyyppien vaihtelu</a>.<br> Huomaa: 'Verkkosivut' sisältävät erilaisia 'verkkosivutiloja'; katso määritelmä <a href={{link_page_state}}>verkkosivun tila</a>.",
    "LABEL_OTHER": "Muut..."
}