{
    "TITLE": "Vaihe 5: Raportoi Arviointitulokset",
    "INTRO": "Anna lisää tietoa arvioinnista jonka haluat sisällyttää raporttiin. Arviointitulokset jotka olet antanut aiemmassa vaiheessa ovat alla kohdassa 'Yksityiskohtaiset arviointitulokset' katselmointia varten, auttamaan sinua kirjoittamaan johdon tiivistelmän. Enemmän ohjeistusta tästä vaiheesta tarjotaan <a href={{link_em_5}}>WCAG-EM Vaihe 5: Raportoi Arviointitulokset</a>.",
    "LABEL_TITLE": "Raportin otsikko",
    "TITLE_PREFIX": "Raportti",
    "INF_TITLE": "Anna verkkosivuston saavutettavuusarviointiraportin otsikko. Esimerkiksi:<br> 'Esimerkkiorganisaation arviointiraportti'<br> 'Verkkokaupan saavutettavuusanalyysi ja korjausehdotukset'",
    "LABEL_COMMISSIONER": "Arvioinnin toimeksisaattaja",
    "INF_COMMISSIONER": "Henkilö, ryhmä, organisaatio, sisäinen ysikkö tai muu kokonaisuus, joka käynnisti arviointitarpeen.",
    "LABEL_CREATOR": "Arvioija",
    "INF_CREATOR": "Henkilö, ryhmä, organisaatio, sisäinen ysikkö tai muu kokonaisuus, joka oli arvioinnista vastuullinen.",
    "LABEL_DATE": "Arviointipäivämäärä",
    "INF_DATE": "anna arvioinnin suorituspäivämäärä tai kesto päivinä. Voit käyttää mitä tahansa päiväformaattia.",
    "LABEL_SUMMARY": "Johdon tiivistelmä",
    "INF_SUMMARY": "Anna lyhyt tiivistelmä arviointilöydöksistä antaaksesi tuloksista yleiskatsauksen. Esimerkiksi, kuvaa sivuston yleistä saavutettavuutta ja avainhuomioita, joita teit arvioinnin aikana, kuten usein toistuvia ongelmia ja toimintamalleja.",
    "LABEL_SPECIFICS": "Tallenna arvioinnin erityispiirteet (vaihtoehtoinen)",
    "INF_SPECIFICS": "WCAG-EM ehdottaa, että arkistoit auditoidut verkkosivut. Saadaksesi lisätietoja, katso <a href={{link_em_5b}}>WCAG-EM Vaihe 5.b: Tallenna arvioinnin erityispiirteet</a>. Voit käyttää tätä tekstikenttää tallentaaksesi arviointityökalut, verkkoselaimet, avustavat teknologiat, muut ohjelmistot, ja menetelmät joita arvioinnissa on käytetty. Tähän kohtaan lisäämäsi tiedot sisällytetään luotuun raporttiin. Kun lataat raportin , voit poistaa tai muokata tätä informaatiota HTML tiedostossa ennen raportin toimitttamista.",
    "HD_CRITERIA_REPORT": "Yksityiskohtaiset auditointitulokset"
}