{
    "TITLE": "WCAG-EM Raportointityökalu",
    "SUBTITLE": "Verkkosivuston saavutettavuusraportin luontityökalu",
    "INTRO_HD": "Mitä työkalu tekee",
    "INTRO_1": "Tämä työkalu auttaa sinua luomaan raportin <a href={{link_wcagem}}>Verkkosivuston saavutettavuuden ohjeidenmukaisuuden menetelmällä (WCAG-EM)</a>. Se ei tee yhtään saavutettavuustarkistusta. Työkalu auttaa sinua seuraamaan WCAG-EM vaiheita, luodaksesi <a href={{link_report}}>rakenteisen raportin</a> antamistasi tiedoista. Se on suunniteltu kokeneille arvioijille, jotka tuntevat <a href={{link_wcag}}>Verkkosivuston saavutettavuusohjeet (WCAG) 2.0</a> ja jotka ovat osittain perehtyneitä WCAG-EM:n. Johdannoksi WCAG-EM:n, katso <a href={{link_conformance}}>WCAG-EM Yleiskatsaus</a>.",
    "INTRO_2": "<strong>Huomaa:</strong> Tämä työkalu ei automaattisesti tallenna antamasi tietoja. Tallentaaksesi tiedot paikallisesti tietokoneellesi, käytä Windowsin pikanäppäinyhdistelmää Ctrl+S tai Mac:ssä {{mac}} avataksesi 'Tallenna'-valikon. (Tai 'Tallenna' linkki sivun ylälaidasta tallentaaksesi evaluointiraportin, josta valitse 'Tallenna tiedosto paikallisesti tietokoneellesi' linkki avaa Tallenna dialogin.)",
    "USAGE_HD": "Kuinka työkalu toimii",
    "USAGE_LI1": "Kaikki toiminnallisuus on nyt ladattu ja toimii paikallisesti verkkoselaimessasi. Et tarvitse verkkoyhteyttä tästä eteenpäin. Kun suljet verkkoselaimen ikkunan, kaikki tallentamaton data häviää.",
    "USAGE_LI2": "Kaikki antamasi tiedot työkalussa tallennetaan JSON datana taustalle (verkkoselaimeesi, ei palvelimelle). Voit valita 'Talleta' ajoittain jotta vältät tietojen katoamisen, jos verkkoselaimesi sulkeutuu.",
    "USAGE_LI3": "Voit tallettaa keskeneräiset raportit ja jatkaa työskentelyä niiden parissa myöhemmin. Jatkaaksesi tallennetun tiedoston kanssa, käytä 'Avaa' linkkiä ylhäältä ja valitse aiemmin tallentamasi tiedosto.",
    "USAGE_LI4": "Linkit jotka eivät ole osa navigaatiota tai toiminnallisuutta (linkit ulkoisiin resursseihin) avautuvat uuteen selainikkunaan.",
    "TIPS_HD": "Vinkkejä työkalun käyttämiseen",
    "TIPS_LI1": "Voit mennä takaisin ja eteenpäin eri vaiheissa missä tahansa järjestyksessä. Yksikään kentistä ei ole pakollinen.",
    "TIPS_LI2": "Saadaksesi lisää tietoja tietystä kentästä, valitse {{info}} ikoni kentän vierestä.",
    "TIPS_LI3": "Työkalu antaa raporttisi HTML ja CSS tiedostona. Voit ladata nämä tiedostot 'Katso Raportti' sivulta. Voit sitten muuttaa raportin sisältöä ja visuaalista ulkomuotoa.",
    "TIPS_LI4": "Voit sisällyttää raporttiisi WCAG 2.0 kriteereitä yli ohjeidenmukaisuustavoitteiden kriteerien. Esimerkiksi, jos verkkosivusto on vaadittu toimivan Tasolla AA, voit silti sisällyttää Tason AAA kriteereitä raporttiin. Vaiheessa 4, käytä tason suodatinta näyttämään korkeamman tason kriteerit. Mikä tahansa kriteeri johon on annettu tulos sisällytetään aina raporttiin."
}